#ניצור מחלקה מסוג כדור שהיא תעשה ירושה לספריית Turtel
from turtle import Turtle

class Ball(Turtle):
    def __init__(self):
        super().__init__()
        self.color("white")
        self.penup()
        self.shape("circle")
        # ניצור 2 משתנים שתפקידים זה להראות את קצב ההתקדמות של הכדור
        self.x_move = 10
        self.y_move = 10

    # ניצור פונקציה שתיגרום לכדור לזוז

    def move(self):
        # ניעזר בקורדינטות של X ו Y כדי שהכדור יזוז
        new_x = self.xcor() + self.x_move
        new_y = self.ycor() + self.y_move
        # נשלח את הכדור כל פעם לקורדינטה אחרת
        self.goto(new_x, new_y)

    # ניצור פונקציה שאחראית על הקפיצה של הכדור בקרכ שהוא פוגע בקיר העליון והתחתון
    def bounce_y(self):
        # זה אומר שאם הקצב גדילה היה פלוס 10 אז כשהכדור פוגע בקיר הגדילה יהיה -10 בציר ה Y כדי שהכדור יחזור בחזרה
        # נכפיל במינוס 1 כדי לשנות את הכיון של הכדור כי אם המספר חיובי הוא יהיה שלילי וירד למטה ואם המספר שלילי הוא יהיה חיובי ויעלה למעלה
        self.y_move *= -1

    # בדיקה האם הכדור פגע במחבט בעזרת ציר ה X
    def bounce_x(self):
        # נשנה את הקורדינטה של ציר ה X
        self.x_move *= -1

    # לפונקציה שמאתחלת את המיקום של הכדור באמצע המסך כאשר הכדור עובר את הגבול מצד ימין
    def reset_position(self):
        self.goto(0, 0)
        # נירצה שהכיון של הכדור יהיה בכיון השני ונעשה
        # בעזרת הכפלה במינוס 1 הכיון של הקורדינטה של ציר האיקס יהיה לכיון השמאלי
        self.bounce_x()